app/controllers/attendances_controller.rb

	def index
		@attendance = Attendance.all
---
SELECT "attendances".* FROM "attendances"

	def show
		@attendance = Attendance.find(params[:id])
---
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create

		@attendance = Attendance.new(attendance_params)

		if @attendance.save
---
INSERT INTO "attendances" ("status", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["status", "P"], ["student_id", 3], ["created_at", 2016-10-11 10:33:38 UTC], ["updated_at", 2016-10-11 10:33:38 UTC]]