app/controllers/exams_controller.rb

SELECT "exams".* FROM "exams"
---
	def index
		@exam = Exam.all

SELECT  "exams".* FROM "exams" WHERE "exams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def show
		@exam = Exam.find(params[:id])

INSERT INTO "exams" ("name", "start_date", "standard_id", "subject_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Half year exam"], ["start_date", 2016-11-08 06:53:15 UTC], ["standard_id", 1], ["subject_id", 3], ["created_at", 2016-10-11 10:05:47 UTC], ["updated_at", 2016-10-11 10:05:47 UTC]]
---
	def create

		@exam = Exam.new(exam_params)

		if @exam.save