app/controllers/results_controller.rb

	def index
		@result = Result.all
---
SELECT "results".* FROM "results"

	def show
		@result = Result.find(params[:id])
---
SELECT  "results".* FROM "results" WHERE "results"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def create

		@result = Result.new(result_params)

		if @result.save
---
INSERT INTO "results" ("status", "marks", "division", "subject_id", "student_id", "standard_id", "created_at", "updated_at", "exam_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"