app/controllers/schools_controller.rb

SELECT "schools".* FROM "schools"
---
	def index

		@school = School.all

INSERT INTO "schools" ("name", "address", "team", "course_offer", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "swe"], ["address", "ew"], ["team", "ews"], ["course_offer", "ewr"], ["created_at", 2016-10-11 07:25:24 UTC], ["updated_at", 2016-10-11 07:25:24 UTC]]
---
	def create

		 @school = School.new(school_params)
  if @school.save

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
	def edit
		 @school = School.find(params[:id])

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "schools" SET "name" = $1, "updated_at" = $2 WHERE "schools"."id" = $3  [["name", "fixnix university chennai"], ["updated_at", 2016-10-11 12:45:36 UTC], ["id", 1]]
---
	def update

		  @school = School.find(params[:id])
  if @school.update_attributes(school_params)