app/controllers/sections_controller.rb

	def index
		@section = Section.all
---
SELECT "sections".* FROM "sections"

	def create

		 @section = Section.new(section_params)
  if @section.save
---
INSERT INTO "sections" ("name", "standard_id", "created_at", "updated_at", "exam_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "AA"], ["standard_id", 1], ["created_at", 2016-10-12 12:56:14 UTC], ["updated_at", 2016-10-12 12:56:14 UTC], ["exam_id", 2]]