app/controllers/standards_controller.rb

SELECT "standards".* FROM "standards"
---
	def index
		@standard = Standard.all

SELECT  "standards".* FROM "standards" WHERE "standards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def show
		@standard =Standard.find(params[:id])

INSERT INTO "standards" ("name", "school_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "5th"], ["school_id", 2], ["created_at", 2016-10-11 08:09:45 UTC], ["updated_at", 2016-10-11 08:09:45 UTC]]
---
	def create
		@standard = Standard.new(standard_params)

		unless @standard.save

SELECT  "standards".* FROM "standards" WHERE "standards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def edit

		@standard = Standard.find(params[:id])

SELECT  "standards".* FROM "standards" WHERE "standards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "standards" SET "name" = $1, "school_id" = $2, "updated_at" = $3 WHERE "standards"."id" = $4  [["name", "10th ."], ["school_id", 1], ["updated_at", 2016-10-11 13:09:26 UTC], ["id", 1]]
---
	def update
		@standard = Standard.find(params[:id])

		if @standard.update_attributes(standard_params)