app/controllers/students_controller.rb

	def create

		 @student = Student.new(student_params)
  if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "age", "email_id", "phone_no", "address", "section_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

	def update

				@student = Student.find(params[:id])

			if @student.update_attributes(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["first_name", "abcd"], ["updated_at", 2016-10-11 13:28:15 UTC], ["id", 3]]