app/controllers/subjects_controller.rb

	def index
		@subject = Subject.all
---
SELECT "subjects".* FROM "subjects"

	def create

		@subject = Subject.new(subject_params)

		if @subject.save
---
INSERT INTO "subjects" ("name", "description", "credit", "teacher_id", "standard_id", "created_at", "updated_at", "exam_id", "student_id", "result_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"