app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers"
---
	def index
		@teacher = Teacher.all

INSERT INTO "teachers" ("first_name", "last_name", "age", "email_id", "phone_no", "address", "area_of_expertise", "qualification", "experience", "standard_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
	def create

		@teacher = Teacher.new(teacher_params)

		if @teacher.save